#-*- coding: utf-8 -*-

##Να τροποποιήσετε την άσκηση 1 ώστε να σταματάει η είσοδος των δεδομένων όταν: 
    #∆2Α.  δοθεί αντί για πόλη η ΤΕΛΟΣ” 
    #∆2Β. δοθούν 20 βαθμοί        
    #∆2Γ. δοθούν 2 μαθητές  από τη Χίο 
    #∆2Δ. το σύνολο της  βαθμολογίας ξεπεράσει το 1000 
##Επίσης εμφανίζει 
    #∆3Α. για όλους τους  µαθητές τη πόλη και τη βαθμολογία τους 
    #∆3Β. πόσοι µαθητές είναι από τα Ιωάννινα 
    #∆3Γ. πόσοι µαθητές από τη Χίο έχουν βαθμό μεγαλύτερο από 18 
    #∆3Δ. τη πόλη και τη βαθμολογία που έχει ο μαθητής με όνομα ''Νίκος Γεωργίου'' 


# αντί για 20 βαθμούς βάζω όριο 3, αντί για άθροισμα βαθμών 1000 βάζω 50(για συντομία τέστ)

name = []
grade = []
city = []
plx=0
countg = 0
sumg = 0
c = ""
while c != "telos" and countg < 3 and plx < 2 and sumg < 100:
    c = raw_input("Σε ποιά πόλη ο μαθητής δίνει εξετάσεις. Για τέλος δώστε 'telos': ")
    n = raw_input("Εισάγετε όνομα μαθητή. ")
    g = input("Δώστε βαθμό μαθητή: ")     
    name.append(n)
    grade.append(g)
    city.append(c)
    if c == "xios":
        plx += 1
    sumg += g
    countg += 1
print name
print grade
print city

pli=0
pl18=0
for i in range(len(city)):
    print name[i], city[i], grade[i]
    if city[i]=="ioannina":
        pli += 1
    if city[i] == "xios":
        if grade[i]>18:
            pl18 += 1
    if name[i]=="nikos":
        print  "Ο", name[i], "από την πόλη", city[i], "πήρε βαθμό", grade[i]

print "Οι μαθητές από Ιωάννινα είναι", pli
print "Οι μαθητές από την Χίο με βαθμό μεγαλύτερο του 18 είναι", pl18
    
