#-*- coding: utf-8 -*-

##1. Να γράψετε ένα πρόγραµµα σε Python το οποίο για κάθε μαθητή που δίνει 
##πανελλήνιες εξετάσεις θα: 
##Δ1 ∆ιαβάζει το όνοµα, τον τελικό βαθµό και την πόλη και θα αποθηκεύει τα δεδοµένα στις 
##λίστες name, grade, city. 
##∆2. σταµατάει η είσοδος των δεδοµένων όταν δοθεί αντί για όνοµα το γράµµα “Τ” 
##∆3. εμφανίζει το µέσο όρο των µαθητών από τα Ιωάννινα 
##∆4. εμφανίζει   τα   ονόµατα   των   µαθητών   που   έχουν βαθµό µεγαλύτερο από τον 
##παραπάνω µέσο όρο. 
 

name = []
grade = []
city = []
n = raw_input("Εισάγετε όνομα μαθητή. Για τέλος δώστε 'Τ': ")
while n != "T":
    g = input("Δώστε βαθμό μαθητή: ")
    c = raw_input("Σε ποιά πόλη δίνει εξετάσεις: ")
    name.append(n)
    grade.append(g)
    city.append(c)
    n = raw_input("Εισάγετε όνομα μαθητή. Για τέλος δώστε 'Τ': ")    
       

sumg = 0.0
pl = 0
key = "ioannina"

for i in range(len(city)):
    if key == city[i]:
        sumg += grade[i]
        pl += 1
if pl != 0:
    mo = sumg/pl
    print "Ο μέσος όρος των μαθητών από Ιωάννινα είναι", mo
else:
    mo = 0

if mo != 0:
    ming = mo
    for i in range(len(grade)):
        if grade[i]>mo:
            print name[i]
else:
    print "Δεν υπάρχουν μαθητές από τα Ιωάννινα"
    
